SPedt/src/DataProcessors/ВыдачаТранзита/ВыдачаТранзита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ВыдачаТранзита</name>
</mdclass:DataProcessor>

SPedt/src/Documents/ВыдачаТранзита/ВыдачаТранзита.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВыдачаТранзита</name>
  <registerRecords>InformationRegister.СтатусыДоставкиСвернуто</registerRecords>
  <registerRecords>AccumulationRegister.Расход</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн</registerRecords>
  <registerRecords>AccumulationRegister.Обмен100СПрн_Ошибки</registerRecords>
  <registerRecords>InformationRegister.Обмен100сп</registerRecords>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>AccumulationRegister.СобранныеЗаказы</registerRecords>
  <registerRecords>InformationRegister.СтатусыЗаявокВТК</registerRecords>
  <registerRecords>InformationRegister.СтатусыДоставки</registerRecords>
  <registerRecords>AccumulationRegister.УпакованныеЗаказы</registerRecords>
  <registerRecords>InformationRegister.Обмен100спСообщения</registerRecords>
  <registerRecords>AccumulationRegister.КПолучению</registerRecords>
  <registerRecords>AccumulationRegister.ОборотнаяТараДвижение</registerRecords>
  <attributes>
    <name>ТочкаНазначения</name>
    <type>
      <types>CatalogRef.СегментыПунктовВыдачи</types>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаТранзита</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаОтправитель</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПоОбмену</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерОтправителя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>12</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьХранения</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.ВидыОперацийВыдачаТранзита</types>
    </type>
  </attributes>
  <attributes>
    <name>АктТК</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДоставки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТрэкНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортнаяКомпания</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Супергруппа</name>
    <type>
      <types>CatalogRef.Мегаордера</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьСупергруппы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСдачиВТК</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОграничениеВыдачи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ОшибочныеЗаказы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>DefinedType.ТипыЗаказа</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяХранения</name>
      <comment>в днях</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьХранения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.Движение</types>
        <types>DocumentRef.ФормированиеКоробки</types>
        <types>DocumentRef.УпаковатьЗаказы</types>
        <types>DocumentRef.ОтправлениеТранзита</types>
        <types>DocumentRef.ЗаказыДляТранзита</types>
        <types>DocumentRef.Приходная</types>
        <types>DocumentRef.КурьерскаяДоставка</types>
        <types>DocumentRef.ПоступлениеПристроя</types>
        <types>DocumentRef.РазборКоробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>Подбор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Предупреждение</name>
      <type>
        <types>EnumRef.ПредупрежденияПрихода</types>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаНазначения</name>
      <type>
        <types>CatalogRef.СегментыПунктовВыдачи</types>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкаВТранспортнуюКомпанию</types>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьИтого</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ШК</name>
      <type>
        <types>CatalogRef.Мегаордера</types>
      </type>
    </attributes>
    <attributes>
      <name>Упакован</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерОтправителя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>25</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоСУчетомСГ</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПерваяТочка</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПраздничныхДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъявленнаяСтоимость</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЗаявкиВТК</name>
    <attributes>
      <name>Заявка</name>
      <type>
        <types>DocumentRef.ЗаявкаВТранспортнуюКомпанию</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПартииТК</name>
    <attributes>
      <name>НомерПартии</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Комментарий</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПротоколыПередач</name>
    <attributes>
      <name>ДатаНачала</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончания</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Результат</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ОборотнаяТара</name>
    <attributes>
      <name>Тара</name>
      <type>
        <types>CatalogRef.ОборотнаяТара</types>
      </type>
    </attributes>
    <attributes>
      <name>ПунктВыдачи</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SPedt/src/Documents/УпаковатьЗаказы/УпаковатьЗаказы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УпаковатьЗаказы</name>
  <registerRecords>AccumulationRegister.Транзит</registerRecords>
  <registerRecords>AccumulationRegister.УпакованныеЗаказы</registerRecords>
  <attributes>
    <name>ТочкаОтправитель</name>
    <type>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>ТочкаНазначения</name>
    <type>
      <types>CatalogRef.СегментыПунктовВыдачи</types>
      <types>CatalogRef.ТочкиРаздачи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтролироватьСупергруппы</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Супергруппа</name>
    <type>
      <types>CatalogRef.Мегаордера</types>
    </type>
  </attributes>
  <attributes>
    <name>МестоХраненияСупергруппы</name>
    <type>
      <types>CatalogRef.МестаХранения</types>
    </type>
  </attributes>
  <attributes>
    <name>ГабаритСупергруппы</name>
    <type>
      <types>CatalogRef.Габариты</types>
    </type>
  </attributes>
  <attributes>
    <name>СтоимостьИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоИтого</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Покупки</name>
    <attributes>
      <name>Подбор</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Покупка</name>
      <type>
        <types>DefinedType.ТипыЗаказа</types>
      </type>
    </attributes>
    <attributes>
      <name>Участник</name>
      <type>
        <types>CatalogRef.Участники</types>
      </type>
    </attributes>
    <attributes>
      <name>МестоХранения</name>
      <type>
        <types>CatalogRef.МестаХранения</types>
      </type>
    </attributes>
    <attributes>
      <name>Габарит</name>
      <type>
        <types>CatalogRef.Габариты</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Партия</name>
      <type>
        <types>DocumentRef.Движение</types>
        <types>DocumentRef.ФормированиеКоробки</types>
        <types>DocumentRef.ОтправлениеТранзита</types>
        <types>DocumentRef.Приходная</types>
        <types>DocumentRef.ПоступлениеПристроя</types>
        <types>DocumentRef.РазборКоробки</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтоимостьХранения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВремяХранения</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТочкаНазначения</name>
      <type>
        <types>CatalogRef.ТочкиРаздачи</types>
      </type>
    </attributes>
    <attributes>
      <name>Вес</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Объем</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>16</precision>
          <scale>5</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПраздничныхДней</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>БесплатнаяВыдача</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

SPedt/src/DataProcessors/ВыдачаТранзита/Forms/Форма/Module.bsl
#Область КомандыФормы

&НаКлиенте
Процедура ПередатьКурьеру(Команда)
	НоваяМетодика = СинхронизацияПоступлений.НоваяМетодика(ТекущаяДата());
	Если НоваяМетодика Тогда
		СинхронизацияПоступлений.Синхронизировать(ПВНазначения);
		ОткрытьФорму(	"Документ.ВыдачаТранзита.ФормаОбъекта",
						новый Структура("ТочкаНазначения",ПВНазначения),ЭтаФорма,Истина);
						
	Иначе	
		
		ОткрытьФорму(	"Обработка.ВыдачаТранзита.Форма.НеПодтвержденныеПосылки",
						новый Структура("ИсточникВызова, ПунктВыдачи","ВыдачаТранзита",ПВНазначения),
						ЭтаФорма,Истина);		
	КонецЕсли;					

КонецПроцедуры


&НаКлиенте
Процедура ПередатьЗаморозку(Команда)
	НоваяМетодика = СинхронизацияПоступлений.НоваяМетодика(ТекущаяДата());
	Если НоваяМетодика Тогда
		СинхронизацияПоступлений.Синхронизировать();
		ОткрытьФорму(	"Документ.ВыдачаТранзита.ФормаОбъекта",
						новый Структура("Заморозка",Истина),ЭтаФорма,Истина);
						
	Иначе		
			ОткрытьФорму(	"Обработка.ВыдачаТранзита.Форма.НеПодтвержденныеПосылки",
						новый Структура("ИсточникВызова, ПунктВыдачи","ВыдачаТранзитаЗаморозка",ПВНазначения),
						ЭтаФорма,Истина);		
	КонецЕсли;
КонецПроцедуры
	


&НаКлиенте
Процедура УпаковатьЗаказы(Команда)
		ОткрытьФорму(	"Обработка.ВыдачаТранзита.Форма.НеПодтвержденныеПосылки",
						новый Структура("ИсточникВызова, ПунктВыдачи","УпаковатьЗаказы",ПВНазначения),
						ЭтаФорма,Истина);		
	
КонецПроцедуры


#КонецОбласти

//&НаСервере
//Процедура ЗаполнитьНаСервере(ТочкаРаздачи,ДанныеФормы);  
//	обДок=ДанныеФормыВЗначение(ДанныеФормы,Тип("ДокументОбъект."+ДанныеФормы.Ссылка.Метаданные().Имя));
//	обДок.ТочкаНазначения=ТочкаРаздачи;
//	Если обДок.Метаданные().Реквизиты.Найти("ТочкаТранзита")<>Неопределено Тогда
//		обДок.ТочкаТранзита=ТочкаРаздачи;
//	КонецЕсли;	
//	обДок.ЗаполнитьПоТочкеНазначения();
//	ЗначениеВДанныеФормы(обДок,ДанныеФормы);
//КонецПроцедуры

&НаКлиенте
Процедура ТочкаРаздачиПриИзменении(Элемент)
	ТочкаРаздачиПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТочкаРаздачиПриИзмененииНаСервере()
	Если ТипЗнч(ПВНазначения) = Тип("СправочникСсылка.ТочкиРаздачи") Тогда
		ТК=ПВНазначения.ТранспортнаяКомпания;
	КонецЕсли;
КонецПроцедуры


&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	Если ИмяСобытия="ВыдачаТранзита" Тогда
		ОткрытьФорму(	"Документ.ВыдачаТранзита.ФормаОбъекта",
						новый Структура("ТочкаНазначения",Параметр),ЭтаФорма,Истина);
						
	ИначеЕсли ИмяСобытия="ВыдачаТранзитаЗаморозка" Тогда
		ОткрытьФорму(	"Документ.ВыдачаТранзита.ФормаОбъекта",
						новый Структура("Заморозка",Истина),ЭтаФорма,Истина);
						
						
	ИначеЕсли ИмяСобытия="УпаковатьЗаказы" Тогда
		ОткрытьФорму(	"Документ.УпаковатьЗаказы.ФормаОбъекта",
						новый Структура("ТочкаНазначения",Параметр),ЭтаФорма,Истина);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Статусы(Команда)
	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияформыДокумента",ЭтаФорма);	
	ОткрытьФорму(	"Обработка.ВыдачаТранзита.Форма.СостоянияЗаказовПоПунктамВыдачи",
						,ЭтаФорма,Истина,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗакрытияформыДокумента(Результат, ДопПараметры) Экспорт
	ОбновитьТранзиты();
КонецПроцедуры



Процедура УстановитьВидимость()
	Элементы.ПередатьЗаморозку.Видимость = (Константы.ОтгружатьЗаморозкуОтдельно.Получить());
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	УстановитьВидимость();
	ОбновитьТранзиты();
	ПодключитьОбработчикОжидания("ОбновитьТранзиты", 7200);

КонецПроцедуры

&НаКлиенте
Процедура ОбновитьТранзиты()
	результат = ПолучитьТранзитыНаСкладе();
	ТранзитовНаСкладе = Результат.Пристрой + Результат.Ошибочные;
	Если ТранзитовНаСкладе = 0 или ТранзитовНаСкладе = null Тогда
		Элементы.ГруппаТранзит.Видимость 	= Ложь;
	Иначе
		Элементы.ГруппаТранзит.Видимость	= Истина;
		Элементы.СформироватьПеремещениеТранзита.Заголовок 		= "Транзитов на складе : "+ТранзитовНаСкладе  ;
	КонецЕсли

КонецПроцедуры

Функция ПолучитьТранзитыНаСкладе()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ТранзитОстатки.Партия) <> ТИП(Документ.ПоступлениеПристроя)
		|			ТОГДА ТранзитОстатки.КоличествоОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Ошибочные,
		|	ТранзитОстатки.Партия КАК Партия,
		|	ВЫБОР
		|		КОГДА ТИПЗНАЧЕНИЯ(ТранзитОстатки.Партия) = ТИП(Документ.ПоступлениеПристроя)
		|			ТОГДА ТранзитОстатки.КоличествоОстаток
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК Пристрой
		|ПОМЕСТИТЬ сбор
		|ИЗ
		|	РегистрНакопления.Транзит.Остатки КАК ТранзитОстатки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ЕСТЬNULL(СУММА(сбор.Ошибочные), 0) КАК Ошибочные,
		|	ЕСТЬNULL(СУММА(сбор.Пристрой), 0) КАК Пристрой
		|ИЗ
		|	сбор КАК сбор";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда
		Возврат		Новый структура("Пристрой, Ошибочные", Выборка.Пристрой, Выборка.Ошибочные)	;
	КонецЕсли;
	
	Возврат Новый структура("Пристрой, Ошибочные", 0,0 );
КонецФункции

&НаКлиенте
Процедура СформироватьПеремещениеТранзита(Команда)
		//ПунктВыдачи 		= Элементы.СостоянияОтгрузки.ТекущиеДанные.ПунктВыдачи;
		ПараметрыЗаполнения	= Новый Структура();
		ПараметрыЗаполнения.Вставить("Дата", 			ТекущаяДата());
		ПараметрыЗаполнения.Вставить("ВидОперации", 	"ТранзитНаВозврат");
		ПараметрыЗаполнения.Вставить("МестоХранения", 	Неопределено);
		ПараметрыЗаполнения.Вставить("Габарит", 		Неопределено);
		ПараметрыЗаполнения.Вставить("Организатор", 	Неопределено);  
		ПараметрыЗаполнения.Вставить("ПунктВыдачи", 	Неопределено);  
		ПараметрыЗаполнения.Вставить("ДатаОтчета", 		КонецДня(ТекущаяДата()));

		
		ПараметрыЗаполнения.Вставить("ЭтоПристрой", новый структура("ПравоеЗначение, Использование, ВидСравнения",Ложь, Истина, ВидСравненияКомпоновкиДанных.Равно) );
		//ПараметрыЗаполнения.Вставить("Точка", 		новый структура("ПравоеЗначение, Использование", ПунктВыдачи, Истина) );
	
    	ОписаниеОповещения = Новый ОписаниеОповещения("ПослеЗакрытияформыДокумента",ЭтаФорма);
	
		ОткрытьФорму("Документ.ДвижениеТранзита.ФормаОбъекта",Новый структура("ПараметрыЗаполнения",ПараметрыЗаполнения) ,ЭтаФорма,,,,ОписаниеОповещения,РежимОткрытияОкнаФормы.БлокироватьВесьИнтерфейс  );
КонецПроцедуры




&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если не ЗначениеЗаполнено(ПВНазначения) Тогда
		Умолчания = Константы.ПунктВыдачиТранзита.Получить();
		Если не ЗначениеЗаполнено(Умолчания) Тогда
			ПВНазначения = Справочники.ТочкиРаздачи.ПустаяСсылка();
		Иначе
			ПВНазначения = Умолчания;
		КонецЕсли;	
	КонецЕсли;	
	
	
КонецПроцедуры


&НаКлиенте
Процедура ОбновитьТранзитыКОманда(Команда)
	ОбновитьТранзиты()
КонецПроцедуры

&НаКлиенте
Процедура ВыдатьПоСегменту(Команда)
	ОткрытьФорму("Обработка.ВыдачаТранзита.Форма.ФормированиеНакладныхПоСегменту");
КонецПроцедуры
